#define _CRT_SECURE_NO_WARNINGS 1

#include <stdio.h>

//操作符

//int main()
//{
//	//算数操作符
//	// + - * /
//	//对于除，执行的是整形除法
//	int a = 5 / 2;//商2余1
//	printf("%d\n", a);//只取整数部分，不取小数部分；输出2
//
//	float b = 5 / 2;//计算的结果还是2，如果需要计算结果小数，则需要其中一个数为浮点数
//	printf("%f\n", b);
//
//	b = 5 / 2.0;//如果需要计算结果得到小数，则需要其中一个数为浮点数
//	printf("%f\n", b);
//
//
//	//% - 取模（余）得到的是整除之后的余数
//	int c = 7 % 2;//3....1
//	printf("%d\n", c);//输出1；
//	return 0;
//}

//int main()
//{
//	//移位操作符 --二进制位的
//	//右移操作符  >>
//	//左移操作符  <<
//	int a = 6;
//	int b = a << 1;
//	//移动的是二进制位
//	// a = 6
//	// 00000000 00000000 00000000 00000110
//	// 00000000 00000000 00000000 00001100 -- 左边丢弃右边补0
//	printf("%d\n", b);
//	return 0;
//}



//int main()
//{
//	//位操作符
//	//& -- 按2进制位与 -- 对应2进制位同时为1 则为1
//	//^ -- 按2进制位异或 -- 对应2进制位相同为0 相异为1
//	//| -- 按2进制位或 -- 对应2进制位只要有一个为1则为1
//
//	int a = 3;
//	int b = 5;
//
//	//按位与
//	int c = a & b;
//	//00000000 00000000 00000000 00000011
//	//00000000 00000000 00000000 00000101
//	//00000000 00000000 00000000 00000001
//	printf("%d\n", c);//1
//
//	//按位异或
//	int k = a ^ b;
//	//00000000 00000000 00000000 00000011
//	//00000000 00000000 00000000 00000101
//	//00000000 00000000 00000000 00000110
//	printf("%d\n", k);//6
//
//	// 按位或
//	int d = a | b;
//	//00000000 00000000 00000000 00000011
//	//00000000 00000000 00000000 00000101
//	//00000000 00000000 00000000 00000111
//	printf("%d\n", d);//7
//	return 0;
//}


//int main()
//{
//	//赋值操作符
//	int a = 10;//创建变量a，并且初始化为10
//	a = 20;//赋值
//
//	a = a + 10;
//	a += 10;//符合赋值
//
//	return 0;
//}



//单目操作符
//只有一个操作数

//int main()
//{
//	//真和假
//	//非0 就是真 -- 统一用1表示
//	//0就是假 -- 0表示假
//	int a = 10;
//	printf("%d\n", !a);//0
//
//	a = 0;
//	printf("%d\n", !a);//1
//
//	//使用
//	a = 10;
//	if (a)//a为真，进入if语句
//	{
//
//	}
//	if (!a)//a为假，进入if语句
//	{
//
//	}
//
//
//	//负值
//	int b = 10;
//	int c = -b;//负值
//	return 0;
//}



//int main()
//{
//	int a = 10;
//	//sizeof计算变量或类型所占内存空间的大小（以字节为单位）
//	printf("%d\n", sizeof(a));//4
//	printf("%d\n", sizeof(int));//4
//
//	return 0;
//}


//整数在内存中存储的时候，存储的是二进制
//一个整数的二进制表示有3中形式
//源码
//反码
//补码

//正的整数：源码、反码、补码相同
//负的整数：源码、反码、补码是计算的

//有符号的整数，最高位是0，表示正数
//			  最高位是1，表示负数
//int a = 1;//4个字节 -- 32bit
//00000000 00000000 00000000 00000001 -- 源码（根据真实值，以及它的符号位，写出的二进制序列叫做源码）
//00000000 00000000 00000000 00000001 -- 反码
//00000000 00000000 00000000 00000001 -- 补码

//int a = -1;
//10000000 00000000 00000000 00000001 -- 源码（根据真实值，以及它的符号位，写出的二进制序列叫做源码）
//11111111 11111111 11111111 11111110 -- 反码 （源码的符号位不变，其他位按位取反得到反码）
//11111111 11111111 11111111 11111111 -- 补码 （反码的二进制序列+1得到补码）

//内存中存储整数的时候，存储的是二进制的补码
//计算的时候采用的也是补码
//int main()
//{
//	//~ 对一个数的二进制按位取反
//	int a = 0;
//	printf("%d\n", ~a);
//	//00000000 00000000 00000000 00000000 -- 0的原反补相同
//	//11111111 11111111 11111111 11111111 - 补码
//	//11111111 11111111 11111111 11111110 - 反码 （补码-1）
//	//10000000 00000000 00000000 00000001 - 源码（符号位不变，其他位按位取反）  -1
//
//	//内存中存储的是补码，但打印出来的是源码
//	return 0;
//}


//int main()
//{
//	//前置++  先++，后使用
//	//后置++  先使用，后++
//	int a = 2;
//	int c = ++a;//前置++, 先++，后使用
//	printf("%d\n", c);//3
//	printf("%d\n", a);//3
//
//	int d = 2;
//	int b = d++;//后置++，先使用，后++
//	printf("%d\n", b);//2
//	printf("%d\n", d);//3
//
//	return 0;
//}


//强制类型转换
//int main()
//{
//	//强制类型转换
//	int a = (int)3.14;
//
//	printf("%d\n", a);
//	return 0;
//}


//逻辑操作符
//&& -- 逻辑与 -- 并且的意思
//|| -- 逻辑或 -- 或者的意思


//int main()
//{
//	int a = 3;
//	int b = 5;
//	//如果 a==3,并且b==4，打印哈哈
//	if ((a == 3) && (b == 4))//两者必须全部为真
//	{
//		printf("哈哈\n");
//	}
//
//	//如果 a==3,并且b==4，打印呵呵
//	if ((a == 3) || (b == 4))//两者只要有一个满足即可，前面一个满足条件，则后面不在进行判断
//	{
//		printf("呵呵\n");
//	}
//	return 0;
//}



//条件操作符（三目操作符）
//表达式1 ？ 表达式2 ：表达式3
//表达式1结果为真，则表达式2就为整个表达式的结果，否则表达式3就为整个表达式的结果
//int main()
//{
//	int a = 10;
//	int b = 0;
//
//	b = (a == 5) ? -6 : 6;
//	return 0;
//}


//逗号表达式
//int main()
//{
//	int a = 0;
//	int b = 3;
//	int c = -1;
//	//, - 逗号表达式
//	//逗号表达式会从左向右依次计算
//	//整个逗号表达式的结果是最后一个表达式的结果
//	int d = (a = b - 5, b = a + c, c = a + b, c = -5);
//	return 0;
//}


//下表引用操作符
//int Add(int x, int y)
//{
//	return x + y;
//}
//int main()
//{
//	int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };
//	arr[9];//[]下标引用操作符
//
//	//函数调用操作符
//	int ret = Add(3, 5);//()函数调用操作符
//	return 0;
//}



//关键字

//typedef --- 类型重定义
//typedef unsigned int uint;
//int main()
//{
//	unsigned int num1 = 10;
//	uint num2 = 20;
//	return 0;
//}

//register
//int main()
//{
//	//建议把100存放到寄存器中，编译器最终决定
//	register int num = 100;
//	//&num;//num存放到了寄存器中，则不能取地址，取地址是取内存的地址，而寄存器和内存是不同的独立的空间
//	return 0;
//}


//static
//修饰局部变量 -- 改变了变量的生命周期，不影响作用域
//修饰全局变量
//修饰函数


//static修饰局部变量 -- 改变了变量的生命周期，不影响作用域
//void test()
//{
//	static int a = 1;
//	a++;
//	printf("%d ", a);
//}
//int main()
//{
//	int i = 0;
//	while (i < 10)
//	{
//		test();
//		i++;
//	}
//	return 0;
//}


//static修饰全局变量 

//extern -- 声明外部符号
//extern int g_val;
//int main()
//{
//	printf("%d\n", g_val);//不能打印，编译器报错 -- 链接错误
//	return 0;
//}

//声明函数
//extern int  Add(int x, int y);
//int main()
//{
//	int a = 10;
//	int b = 20;
//
//	int c = a + b;
//	printf("%d\n", c);//不能打印，编译器报错 -- 链接错误
//	return 0;
//}


//#define 定义的标识符常量
//#define NUM 100
//
////宏 -- 替换，先替换在计算
//#define MAX(X,Y) (X>Y?X:Y)
//
//int main()
//{
//	int a = 10;
//	int b = 20;
//	int c = MAX(a, b);
//	printf("%d\n", c);
//
//	return 0;
//}