#define _CRT_SECURE_NO_WARNINGS 1

#include <stdio.h>


//算数操作符
//int main()
//{
//	//int ret = 9 / 2;
//	//double ret = 9 / 2;
//	//  对于 /(除号) 两边都是整数，执行的整数除法
//	// 	操作数中浮点数，才执行浮点数除法
//	//printf("%d\n", ret);
//
//	//
//	//double ret = 9 / 2.0;
//	//printf("%lf\n", ret);
//
//	//% - 取模
//	//% 取模操作符只能针对整型类型
//
//	int ret = 10 % 4;
//
//	printf("%d\n", ret);
//
//	return 0;
//}


//移位操作符
//int main()
//{
//	//int a = 15;
//	//int b = a >> -1;//err - 标准未定义行为
//
//
//	//>> - 右移操作符 
//	// 逻辑右移 - 右边丢弃，左边补0
//	// 算术右移 - 右边丢弃，左边补原符号位 （VS2013采用算术右移）
//	//
//	//<< - 左移操作符
//	// 左边丢弃，右边补0
//
//	//int a = 5;
//	//int b = a >> 1;
//	//printf("%d\n", b);
//
//	//int a = -1;
//	//int b = a >> 1;
//	//printf("%d\n", b);
//
//	//<< 
//	//int a = 5;//4byte = 32bit  
//	//int b = a << 1;
//	////int b = a + 1;
//	//printf("%d\n", b);
//	//printf("%d\n", a);
//
//	////00000000000000000000000000000101
//	////00000000000000000000000000000101
//	////00000000000000000000000000000101
//	//
//	//int c = -1;
//	//int d = c << 1;
//	//printf("%d\n", d);//打印的是原码的值
//
//	//10000000000000000000000000000001 - 原码
//	//11111111111111111111111111111110 - 反码
//	//11111111111111111111111111111111 - 补码
//	//
//	//移位操作符，移动的是二进制位
//	//对于整数的二进制有3中表示形式：原码、反码、补码
//	//正整数 - 原码、反码、补码相同
//	//负整数
//	//原码 - 直接按照数字的正负写出的二进制序列
//	//反码 - 原码的符号位不变，其他位按位取法得到的
//	//补码 - 反码+1
//	//整数 在内存中存储的是二进制的补码
//
//	return 0;
//}


//位操作符
int main()
{
	//& - 按2进制位与
	//| - 按位或
	//^ - 异或
	//int a = 3;
	//int b = -2;
	//int c = a & b;

	//printf("%d\n", c);
	//%d -  说明我们要打印c的值，以有符号的形式
	//00000000000000000000000000000010
	// 
	//00000000000000000000000000000011
	//11111111111111111111111111111110
	//00000000000000000000000000000010
	//
	// 
	//10000000000000000000000000000010 - -2的原码
	//11111111111111111111111111111101 - -2的反码
	//11111111111111111111111111111110 - -2的补码


	//int a = 3;
	//int b = -2;
	//int c = a | b;
	//printf("%d\n", c);

	//11111111111111111111111111111111
	//11111111111111111111111111111110
	//10000000000000000000000000000001 ~ -1
	// 
	//00000000000000000000000000000011
	//11111111111111111111111111111110
	//11111111111111111111111111111111
	//


	//int a = 3;
	//int b = -2;
	//int c = a ^ b;//二进制位异或
	//printf("%d\n", c);

	//异或 - 相同为0，相异为1
	//11111111111111111111111111111101
	//11111111111111111111111111111100
	//10000000000000000000000000000011  ~ -3
	// 
	//00000000000000000000000000000011
	//11111111111111111111111111111110
	//11111111111111111111111111111101
	
	//& | ^

	int a = 15;
	a & 1;
	a = a >> 1;
	//00000000000000000000000000000111
	// 
	//00000000000000000000000000001111
	//00000000000000000000000000000001
	//00000000000000000000000000000001
	return 0;
}

//练习：

//不能创建临时变量，实现两个数的交换
//int main()
//{
//	int a = 3;
//	int b = 5;
//	//创建临时变量的方法
//	int tmp = 0;
//	printf("a=%d b=%d\n", a, b);
//	//1
//	//tmp = a;
//	//a = b;
//	//b = tmp;

//	//不创建临时变量的方法
//	//方法一：
//	//溢出的问题
//	/*a = a + b;
//	b = a - b;
//	a = a - b;*/
//
//	//方法二：
//	//异或
//	//a = a ^ b;
//	//b = a ^ b;
//	//a = a ^ b;
//	//代码的可读性不够好
//	//只适用于整型
//	//
//	printf("a=%d b=%d\n", a, b);
//	return 0;
//}

//求两个数二进制中不同位的个数
//int main()
//{
//	int m = 0;
//	int n = 0;
//	scanf("%d %d", &m, &n);
//	int i = 0;
//	int count = 0;
//	for (i = 0; i < 32; i++)
//	{
//		int c = m ^ n;
//		if (((c >> i) & 1) == 1)
//			count++;
//	}
//	printf("两个数二进制不同位的个数：%d\n", count);
//	return 0;
//}


//打印整数二进制的奇数位和偶数位
//int main()
//{
//	int n = 1999;
//	int i = 0;
//	printf("偶数位：");
//	for (i = 30; i >= 0; i-=2)
//	{
//
//		printf("%d", (n >> i) & 1);
//
//	}
//	printf("\n");
//	printf("奇数位：");
//	for (i = 31; i >= 1; i -= 2)
//	{
//
//		printf("%d", (n >> i) & 1);
//
//	}
//	printf("\n");
//	return 0;
//}


//统计二进制中1的个数
//int main()
//{
//	int n = 0;
//	scanf("%d", &n);
//	int i = 0;
//	int count = 0;
//	for (i = 0; i < 32; i++)
//	{
//		if (((n >> i) & 1) == 1)
//			count++;
//	}
//	printf("二进制中1的个数：%d\n",count);
//	return 0;
//}


//不允许创建临时变量，交换两个整数的内容
//int main()
//{
//	int m = 10;
//	int n = 20;
//	printf("交换前：m = %d n = %d\n", m, n);
//	//方法一
//	m = m + n;
//	n = m - n;
//	m = m - n;
//	printf("交换后：m = %d n = %d\n", m, n);
//
//	printf("--------------------\n");
//	//方法二
//	printf("交换前：m = %d n = %d\n", m, n);
//	m = m ^ n;
//	n = m ^ n;
//	m = m ^ n;
//	printf("交换后：m = %d n = %d\n", m, n);
//	return 0;
//}



//赋值操作符
//int main()
//{
//	int a = 10;
//	int x = 0;
//	int y = 20;
//	//a = x = y + 1;//连续赋值
//	x = y + 1;
//	a = x;
//
//	printf("%d\n", a);
//	printf("%d\n", x);
//
//	return 0;
//}

//复合赋值操作符
//int main()
//{
//	int a = 10;
//	a = a >> 1;
//	a >>= 1;
//
//	a = a + 10;//1
//	a += 10;   //2
//
//
//	return 0;
//}



//单目操作符

//!逻辑反操作
//- 负值
//+ 正值
//& 取地址
//sizeof 操作数的类型长度（以字节为单位）
//~对一个数的二进制按位取反
//-- 前置、后置--
//++前置、后置++
//* 间接访问操作符(解引用操作符)
//(类型)强制类型转换

//int main()
//{
//	int a = 10;
//
//	int * p = &a;
//
//	int b = *p;
//
//	*p = 20; //解引用操作符
//	
//	printf("a=%d\n", a);
//
//	return 0;
//}



//int main()
//{
//	int a = 10;
//
//	//int arr[10] = { 0 };
//	//arr;//数组首元素的地址
//	//&arr[0];//数组首元素的地址
//	//&arr[9];//取出的是第10个元素的地址
//
//	//&arr;//取出数组的地址
//
//
//	return 0;
//}

//sizeof
//sizeof是操作符，不是函数
//sizeof是计算变量或者类型创建变量的内存大小，单位是和内存中存放什么数据没有关系
//
//int main()
//{
//	//char arr[10] = "abc";
//	//printf("%d\n", sizeof(arr));//10
//	//printf("%d\n", strlen(arr));//3 字符串的长度，关注的内存中是否有\0.计算的是\0之前出现的字符个数
//
//	//int a = 10;
//	//printf("%d\n", sizeof(a));//4
//	//printf("%d\n", sizeof a);//4
//
//	//printf("%d\n", sizeof(int));//4
//	////printf("%d\n", sizeof int);//4
//
//
//	//int a = 5;
//	//short s = 10;
//	//printf("%d\n", sizeof(s = a + 2));//?
//	//printf("%d\n", s);                //?
//	//sizeof 内部的表达式不参与运算
//
//
//	return 0;
//}


//int main()
//{
//	int a = 0;
//	//00000000000000000000000000000000
//	int b = ~a;
//	printf("%d\n", b);
//
//	//00000000000000000000000000000000
//	//11111111111111111111111111111111
//	//11111111111111111111111111111110
//	//10000000000000000000000000000001
//	//-1
//	return 0;
//}

//
//int main()
//{
//	int a = 13;
//	a |= (1 << 1);
//	printf("%d\n", a);//15
//
//	a &= (~(1 << 1));
//	printf("%d\n", a);//13
//
//	//
//	//00000000000000000000000000001101
//	//00000000000000000000000000000010   1<<1;
//	// 
//	//00000000000000000000000000001111
//	//11111111111111111111111111111101
//	//
//	return 0;
//}


//int main()
//{
//	int a = 10;
////	int b = a++;//后置++，先使用，再++
////	int b = ++a;//前置++，先++，后使用
//
//	//int b = a--;//后置--，先使用，再--
//	int b = --a;//前置--,先--，再使用
//
//	printf("%d\n", b);
//	printf("%d\n", a);
//
//	return 0;
//}

//int main()
//{
//	int a = 1;
//	int b = (++a) + (++a) + (++a);//err
//	printf("b=%d\n", b);
//	return 0;
//}


//int main()
//{
//	int a = (int)3.14;//默认写出的浮点数是double的
//	printf("%d\n", a);
//	return 0;
//}


//#include <stdio.h>
//void test1(int arr[10])//int *
//{
//	printf("%d\n", sizeof(arr));//(2)
//}
//void test2(char ch[10])//char*
//{
//	printf("%d\n", sizeof(ch));//(4)
//}
//int main()
//{
//	int arr[10] = { 0 };
//	char ch[10] = { 0 };
//	printf("%d\n", sizeof(arr));//(1)
//	printf("%d\n", sizeof(ch));//(3)
//	test1(arr);
//	test2(ch);
//	return 0;
//}


//逻辑操作符
//int main()
//{
//	int a = 0;
//	int b = 0;
//
//	//int c = a && b;//逻辑与
//	int c = a || b;//逻辑或
//
//	printf("c=%d\n", c);
//
//	return 0;
//}

//int main()
//{
//	int age = 0;
//	if (age >= 10 && age <= 30)
//	{
//
//	}
//	if (age < 10 || age>30)
//	{
//
//	}
//	return 0;
//}

//#include <stdio.h>
//int main()
//{
//	int i = 0, a = 0, b = 2, c = 3, d = 4;
//	//i = a++ && ++b && d++;
//
//	i = a++ || ++b || d++;
//	printf("a = %d b = %d c = %d d = %d\n", a, b, c, d);
//
//	return 0;
//}


//三目操作符 / 条件操作符
//
//int main()
//{
//	int a = 3;
//	int b = 5;
//	int m = 0;
//
//	m = ((a > b) ? (a) : (b));
//
//	//((a > b) ? (m = a) : (m = a));
//
//	return 0;
//}